// Задача 3

Console.WriteLine("Введите число: ");
int use = int.Parse(Console.ReadLine());

if (use % 2 == 0)
{
    Console.WriteLine("Вы ввели четное число.");
}
else
{
    Console.WriteLine("Вы ввели нечетное число.");
}